stevenj/avr-libc3/include/avr/io/atmega32hvb.h
/* Timer/Counter0 Output Compare A Interrupt Enable */
#define TC0_OCIE0A_CLEAR_gc (0x00) /* Timer/Counter0 Output Compare A Interrupt Enable - CLEAR */
#define TC0_OCIE0A_SET_gc   (0x02) /* Timer/Counter0 Output Compare A Interrupt Enable - SET */


/* Timer/Counter0 Overflow Interrupt Enable */
#define TC0_TOIE0_CLEAR_gc (0x00) /* Timer/Counter0 Overflow Interrupt Enable - CLEAR */
#define TC0_TOIE0_SET_gc   (0x01) /* Timer/Counter0 Overflow Interrupt Enable - SET */


/* Timer/Counter 0 Input Capture Flag */
#define TC0_ICF0_CLEAR_gc (0x00) /* Timer/Counter 0 Input Capture Flag - CLEAR */
#define TC0_ICF0_SET_gc   (0x08) /* Timer/Counter 0 Input Capture Flag - SET */


/* Timer/Counter0 Output Compare Flag B */
#define TC0_OCF0B_CLEAR_gc (0x00) /* Timer/Counter0 Output Compare Flag B - CLEAR */
#define TC0_OCF0B_SET_gc   (0x04) /* Timer/Counter0 Output Compare Flag B - SET */


/* Timer/Counter0 Output Compare Flag A */
#define TC0_OCF0A_CLEAR_gc (0x00) /* Timer/Counter0 Output Compare Flag A - CLEAR */
#define TC0_OCF0A_SET_gc   (0x02) /* Timer/Counter0 Output Compare Flag A - SET */


/* Timer/Counter0 Overflow Flag */
#define TC0_TOV0_CLEAR_gc (0x00) /* Timer/Counter0 Overflow Flag - CLEAR */
#define TC0_TOV0_SET_gc   (0x01) /* Timer/Counter0 Overflow Flag - SET */


/* Timer/Counter Synchronization Mode */
#define TC0_TSM_CLEAR_gc (0x00) /* Timer/Counter Synchronization Mode - CLEAR */
#define TC0_TSM_SET_gc   (0x80) /* Timer/Counter Synchronization Mode - SET */


/* Prescaler Reset */
#define TC0_PSRSYNC_CLEAR_gc (0x00) /* Prescaler Reset - CLEAR */
#define TC0_PSRSYNC_SET_gc   (0x01) /* Prescaler Reset - SET */


/*
--------------------------------------------------------------------------------
CELL_BALANCING - Cell Balancing
--------------------------------------------------------------------------------
*/


/*
--------------------------------------------------------------------------------
BATTERY_PROTECTION - Battery Protection
--------------------------------------------------------------------------------
*/


/* Battery Protection Parameter Lock Enable */
#define BATTERY_PROTECTION_BPPLE_CLEAR_gc (0x00) /* Battery Protection Parameter Lock Enable - CLEAR */
#define BATTERY_PROTECTION_BPPLE_SET_gc   (0x02) /* Battery Protection Parameter Lock Enable - SET */


/* Battery Protection Parameter Lock */
#define BATTERY_PROTECTION_BPPL_CLEAR_gc (0x00) /* Battery Protection Parameter Lock - CLEAR */
#define BATTERY_PROTECTION_BPPL_SET_gc   (0x01) /* Battery Protection Parameter Lock - SET */


/* External Protection Input Disable */
#define BATTERY_PROTECTION_EPID_CLEAR_gc (0x00) /* External Protection Input Disable - CLEAR */
#define BATTERY_PROTECTION_EPID_SET_gc   (0x20) /* External Protection Input Disable - SET */


/* Short Circuit Protection Disabled */
#define BATTERY_PROTECTION_SCD_CLEAR_gc (0x00) /* Short Circuit Protection Disabled - CLEAR */
#define BATTERY_PROTECTION_SCD_SET_gc   (0x10) /* Short Circuit Protection Disabled - SET */


/* Discharge Over-current Protection Disabled */
#define BATTERY_PROTECTION_DOCD_CLEAR_gc (0x00) /* Discharge Over-current Protection Disabled - CLEAR */
#define BATTERY_PROTECTION_DOCD_SET_gc   (0x08) /* Discharge Over-current Protection Disabled - SET */


/* Charge Over-current Protection Disabled */
#define BATTERY_PROTECTION_COCD_CLEAR_gc (0x00) /* Charge Over-current Protection Disabled - CLEAR */
#define BATTERY_PROTECTION_COCD_SET_gc   (0x04) /* Charge Over-current Protection Disabled - SET */


/* Discharge High-current Protection Disable */
#define BATTERY_PROTECTION_DHCD_CLEAR_gc (0x00) /* Discharge High-current Protection Disable - CLEAR */
#define BATTERY_PROTECTION_DHCD_SET_gc   (0x02) /* Discharge High-current Protection Disable - SET */


/* Charge High-current Protection Disable */
#define BATTERY_PROTECTION_CHCD_CLEAR_gc (0x00) /* Charge High-current Protection Disable - CLEAR */
#define BATTERY_PROTECTION_CHCD_SET_gc   (0x01) /* Charge High-current Protection Disable - SET */


/* Short-circuit Protection Activated Interrupt Flag */
#define BATTERY_PROTECTION_SCIF_CLEAR_gc (0x00) /* Short-circuit Protection Activated Interrupt Flag - CLEAR */
#define BATTERY_PROTECTION_SCIF_SET_gc   (0x10) /* Short-circuit Protection Activated Interrupt Flag - SET */


/* Discharge Over-current Protection Activated Interrupt Flag */
#define BATTERY_PROTECTION_DOCIF_CLEAR_gc (0x00) /* Discharge Over-current Protection Activated Interrupt Flag - CLEAR */
#define BATTERY_PROTECTION_DOCIF_SET_gc   (0x08) /* Discharge Over-current Protection Activated Interrupt Flag - SET */


/* Charge Over-current Protection Activated Interrupt Flag */
#define BATTERY_PROTECTION_COCIF_CLEAR_gc (0x00) /* Charge Over-current Protection Activated Interrupt Flag - CLEAR */
#define BATTERY_PROTECTION_COCIF_SET_gc   (0x04) /* Charge Over-current Protection Activated Interrupt Flag - SET */


/* Disharge High-current Protection Activated Interrupt */
#define BATTERY_PROTECTION_DHCIF_CLEAR_gc (0x00) /* Disharge High-current Protection Activated Interrupt - CLEAR */
#define BATTERY_PROTECTION_DHCIF_SET_gc   (0x02) /* Disharge High-current Protection Activated Interrupt - SET */


/* Charge High-current Protection Activated Interrupt */
#define BATTERY_PROTECTION_CHCIF_CLEAR_gc (0x00) /* Charge High-current Protection Activated Interrupt - CLEAR */
#define BATTERY_PROTECTION_CHCIF_SET_gc   (0x01) /* Charge High-current Protection Activated Interrupt - SET */


/* Short-circuit Protection Activated Interrupt Enable */
#define BATTERY_PROTECTION_SCIE_CLEAR_gc (0x00) /* Short-circuit Protection Activated Interrupt Enable - CLEAR */
#define BATTERY_PROTECTION_SCIE_SET_gc   (0x10) /* Short-circuit Protection Activated Interrupt Enable - SET */


/* Discharge Over-current Protection Activated Interrupt Enable */
#define BATTERY_PROTECTION_DOCIE_CLEAR_gc (0x00) /* Discharge Over-current Protection Activated Interrupt Enable - CLEAR */
#define BATTERY_PROTECTION_DOCIE_SET_gc   (0x08) /* Discharge Over-current Protection Activated Interrupt Enable - SET */


