stevenj/avr-libc3/include/avr/io/atmega32hvb.h
/*
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
C/ASM COMMON DEFINITIONS
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
*/

/*
================================================================================
Flattened fully qualified IO register names
================================================================================
*/


/* ADC - Analog-to-Digital Converter (0x0000) */
#define ADC_BASE                  _SFR_MEM16(0x0000) /* ADC Base Address */
#define ADC_VADC                  _SFR_MEM16(0x0078) /* VADC Data Register Bytes */
#define ADC_VADCL                 _SFR_MEM8 (0x0078) /* VADC Data Register Bytes LOW BYTE */
#define ADC_VADCH                 _SFR_MEM8 (0x0079) /* VADC Data Register Bytes HIGH BYTE */
#define ADC_VADCSR                _SFR_MEM8 (0x007A) /* The VADC Control and Status register */
#define ADC_VADMUX                _SFR_MEM8 (0x007C) /* The VADC multiplexer Selection Register */

/* WDT - Watchdog Timer (0x0000) */
#define WDT_BASE                  _SFR_MEM8 (0x0000) /* WDT Base Address */
#define WDT_WDTCSR                _SFR_MEM8 (0x0060) /* Watchdog Timer Control Register */

/* FET - FET Control (0x0000) */
#define FET_BASE                  _SFR_MEM8 (0x0000) /* FET Base Address */
#define FET_FCSR                  _SFR_MEM8 (0x00F0) /* FET Control and Status Register */

/* SPI - Serial Peripheral Interface (0x0000) */
#define SPI_BASE                  _SFR_MEM8 (0x0000) /* SPI Base Address */
#define SPI_SPCR                  _SFR_MEM8 (0x004C) /* SPI Control Register */
#define SPI_SPSR                  _SFR_MEM8 (0x004D) /* SPI Status Register */
#define SPI_SPDR                  _SFR_MEM8 (0x004E) /* SPI Data Register */

/* EEPROM - EEPROM (0x0000) */
#define EEPROM_BASE               _SFR_MEM8 (0x0000) /* EEPROM Base Address */
#define EEPROM_EECR               _SFR_MEM8 (0x003F) /* EEPROM Control Register */
#define EEPROM_EEDR               _SFR_MEM8 (0x0040) /* EEPROM Data Register */
#define EEPROM_EEAR               _SFR_MEM16(0x0041) /* EEPROM Read/Write Access */
#define EEPROM_EEARL              _SFR_MEM8 (0x0041) /* EEPROM Read/Write Access LOW BYTE */
#define EEPROM_EEARH              _SFR_MEM8 (0x0042) /* EEPROM Read/Write Access HIGH BYTE */

/* COULOMB_COUNTER - Coulomb Counter (0x0000) */
#define COULOMB_COUNTER_BASE      _SFR_MEM8 (0x0000) /* COULOMB_COUNTER Base Address */
#define COULOMB_COUNTER_CADAC0    _SFR_MEM8 (0x00E0) /* ADC Accumulate Current */
#define COULOMB_COUNTER_CADAC1    _SFR_MEM8 (0x00E1) /* ADC Accumulate Current */
#define COULOMB_COUNTER_CADAC2    _SFR_MEM8 (0x00E2) /* ADC Accumulate Current */
#define COULOMB_COUNTER_CADAC3    _SFR_MEM8 (0x00E3) /* ADC Accumulate Current */
#define COULOMB_COUNTER_CADIC     _SFR_MEM16(0x00E4) /* CC-ADC Instantaneous Current */
#define COULOMB_COUNTER_CADICL    _SFR_MEM8 (0x00E4) /* CC-ADC Instantaneous Current LOW BYTE */
#define COULOMB_COUNTER_CADICH    _SFR_MEM8 (0x00E5) /* CC-ADC Instantaneous Current HIGH BYTE */
#define COULOMB_COUNTER_CADCSRA   _SFR_MEM8 (0x00E6) /* CC-ADC Control and Status Register A */
#define COULOMB_COUNTER_CADCSRB   _SFR_MEM8 (0x00E7) /* CC-ADC Control and Status Register B */
#define COULOMB_COUNTER_CADCSRC   _SFR_MEM8 (0x00E8) /* CC-ADC Control and Status Register C */
#define COULOMB_COUNTER_CADRCC    _SFR_MEM8 (0x00E9) /* CC-ADC Regular Charge Current */
#define COULOMB_COUNTER_CADRDC    _SFR_MEM8 (0x00EA) /* CC-ADC Regular Discharge Current */

/* TWI - Two Wire Serial Interface (0x0000) */
#define TWI_BASE                  _SFR_MEM8 (0x0000) /* TWI Base Address */
#define TWI_TWBR                  _SFR_MEM8 (0x00B8) /* TWI Bit Rate register */
#define TWI_TWSR                  _SFR_MEM8 (0x00B9) /* TWI Status Register */
#define TWI_TWAR                  _SFR_MEM8 (0x00BA) /* TWI (Slave) Address register */
#define TWI_TWDR                  _SFR_MEM8 (0x00BB) /* TWI Data register */
#define TWI_TWCR                  _SFR_MEM8 (0x00BC) /* TWI Control Register */
#define TWI_TWAMR                 _SFR_MEM8 (0x00BD) /* TWI (Slave) Address Mask Register */
#define TWI_TWBCSR                _SFR_MEM8 (0x00BE) /* TWI Bus Control and Status Register */

/* EXINT - External Interrupts (0x0000) */
#define EXINT_BASE                _SFR_MEM8 (0x0000) /* EXINT Base Address */
#define EXINT_PCIFR               _SFR_MEM8 (0x003B) /* Pin Change Interrupt Flag Register */
#define EXINT_EIFR                _SFR_MEM8 (0x003C) /* External Interrupt Flag Register */
#define EXINT_EIMSK               _SFR_MEM8 (0x003D) /* External Interrupt Mask Register */
#define EXINT_PCICR               _SFR_MEM8 (0x0068) /* Pin Change Interrupt Control Register */
#define EXINT_EICRA               _SFR_MEM8 (0x0069) /* External Interrupt Control Register */
#define EXINT_PCMSK0              _SFR_MEM8 (0x006B) /* Pin Change Enable Mask Register 0 */
#define EXINT_PCMSK1              _SFR_MEM8 (0x006C) /* Pin Change Enable Mask Register 1 */

/* TC1 - Timer/Counter, 16-bit (0x0000) */
#define TC16_BASE                 _SFR_MEM8 (0x0000) /* TC16 Base Address */
#define TC16_TIFR1                _SFR_MEM8 (0x0036) /* Timer/Counter Interrupt Flag register */
#define TC16_GTCCR                _SFR_MEM8 (0x0043) /* General Timer/Counter Control Register */
#define TC16_TIMSK1               _SFR_MEM8 (0x006F) /* Timer/Counter Interrupt Mask Register */
#define TC16_TCCR1A               _SFR_MEM8 (0x0080) /* Timer/Counter 1 Control Register A */
#define TC16_TCCR1B               _SFR_MEM8 (0x0081) /* Timer/Counter1 Control Register B */
#define TC16_TCNT1                _SFR_MEM16(0x0084) /* Timer Counter 1 Bytes */
#define TC16_TCNT1L               _SFR_MEM8 (0x0084) /* Timer Counter 1 Bytes LOW BYTE */
#define TC16_TCNT1H               _SFR_MEM8 (0x0085) /* Timer Counter 1 Bytes HIGH BYTE */
#define TC16_OCR1A                _SFR_MEM8 (0x0088) /* Output Compare Register 1A */
#define TC16_OCR1B                _SFR_MEM8 (0x0089) /* Output Compare Register B */

/* TC0 - Timer/Counter, 16-bit (0x0000) */
/* TC16_BASE ALREADY DEFINED */
#define TC16_TIFR0                _SFR_MEM8 (0x0035) /* Timer/Counter Interrupt Flag register */
/* TC16_GTCCR ALREADY DEFINED */
#define TC16_TCCR0A               _SFR_MEM8 (0x0044) /* Timer/Counter 0 Control Register A */
#define TC16_TCCR0B               _SFR_MEM8 (0x0045) /* Timer/Counter0 Control Register B */
#define TC16_TCNT0                _SFR_MEM16(0x0046) /* Timer Counter 0 Bytes */
#define TC16_TCNT0L               _SFR_MEM8 (0x0046) /* Timer Counter 0 Bytes LOW BYTE */
#define TC16_TCNT0H               _SFR_MEM8 (0x0047) /* Timer Counter 0 Bytes HIGH BYTE */
#define TC16_OCR0A                _SFR_MEM8 (0x0048) /* Output Compare Register A */
#define TC16_OCR0B                _SFR_MEM8 (0x0049) /* Output Compare Register B */
#define TC16_TIMSK0               _SFR_MEM8 (0x006E) /* Timer/Counter Interrupt Mask Register */

/* CELL_BALANCING - Cell Balancing (0x0000) */
#define CELL_BALANCING_BASE       _SFR_MEM8 (0x0000) /* CELL_BALANCING Base Address */
#define CELL_BALANCING_CBCR       _SFR_MEM8 (0x00F1) /* Cell Balancing Control Register */

/* BATTERY_PROTECTION - Battery Protection (0x0000) */
#define BATTERY_PROTECTION_BASE   _SFR_MEM8 (0x0000) /* BATTERY_PROTECTION Base Address */
#define BATTERY_PROTECTION_BPIMSK _SFR_MEM8 (0x00F2) /* Battery Protection Interrupt Mask Register */
#define BATTERY_PROTECTION_BPIFR  _SFR_MEM8 (0x00F3) /* Battery Protection Interrupt Flag Register */
#define BATTERY_PROTECTION_BPSCD  _SFR_MEM8 (0x00F5) /* Battery Protection Short-Circuit Detection Level Register */
#define BATTERY_PROTECTION_BPDOCD _SFR_MEM8 (0x00F6) /* Battery Protection Discharge-Over-current Detection Level Register */
#define BATTERY_PROTECTION_BPCOCD _SFR_MEM8 (0x00F7) /* Battery Protection Charge-Over-current Detection Level Register */
#define BATTERY_PROTECTION_BPDHCD _SFR_MEM8 (0x00F8) /* Battery Protection Discharge-High-current Detection Level Register */
#define BATTERY_PROTECTION_BPCHCD _SFR_MEM8 (0x00F9) /* Battery Protection Charge-High-current Detection Level Register */
#define BATTERY_PROTECTION_BPSCTR _SFR_MEM8 (0x00FA) /* Battery Protection Short-current Timing Register */
#define BATTERY_PROTECTION_BPOCTR _SFR_MEM8 (0x00FB) /* Battery Protection Over-current Timing Register */
#define BATTERY_PROTECTION_BPHCTR _SFR_MEM8 (0x00FC) /* Battery Protection Short-current Timing Register */
#define BATTERY_PROTECTION_BPCR   _SFR_MEM8 (0x00FD) /* Battery Protection Control Register */
#define BATTERY_PROTECTION_BPPLR  _SFR_MEM8 (0x00FE) /* Battery Protection Parameter Lock Register */

/* CHARGER_DETECT - Charger Detect (0x0000) */
#define CHARGER_DETECT_BASE       _SFR_MEM8 (0x0000) /* CHARGER_DETECT Base Address */
#define CHARGER_DETECT_CHGDCSR    _SFR_MEM8 (0x00D4) /* Charger Detect Control and Status Register */

/* VOLTAGE_REGULATOR - Voltage Regulator (0x0000) */
#define VOLTAGE_REGULATOR_BASE    _SFR_MEM8 (0x0000) /* VOLTAGE_REGULATOR Base Address */
#define VOLTAGE_REGULATOR_ROCR    _SFR_MEM8 (0x00C8) /* Regulator Operating Condition Register */

/* BANDGAP - Bandgap (0x0000) */
#define BANDGAP_BASE              _SFR_MEM8 (0x0000) /* BANDGAP Base Address */
#define BANDGAP_BGCCR             _SFR_MEM8 (0x00D0) /* Bandgap Calibration Register */
#define BANDGAP_BGCRR             _SFR_MEM8 (0x00D1) /* Bandgap Calibration of Resistor Ladder */
#define BANDGAP_BGCSR             _SFR_MEM8 (0x00D2) /* Bandgap Control and Status Register */

